In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('hiring.csv')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df['test_score(out of 10)'].mean()

7.857142857142857

In [5]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean())

In [6]:
df.experience = df.experience.fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [7]:
# from word2number import w2n
x = {'one':1, 'two':2, 'three':3}
# df.experience =df.experience.apply(lambda x : w2n.word_to_num(x))
df.experience = df.experience.map(x)

In [8]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN               8.000000                           9      50000
1         NaN               8.000000                           6      45000
2         NaN               6.000000                           7      60000
3         2.0              10.000000                          10      65000
4         NaN               9.000000                           6      70000
5         NaN               7.000000                          10      62000
6         NaN               7.857143                           7      72000
7         NaN               7.000000                           8      80000

In [154]:
x = df.drop('salary($)', axis=1)
y = df['salary($)']

In [155]:
from sklearn import linear_model

lr = linear_model.LinearRegression()
lr.fit(x,y)

LinearRegression()

In [156]:
lr.predict([[2,9,6]])

array([53290.89255945])

In [157]:
lr.predict([[12,10,10]])

array([92268.07227784])